# 형 변환

# int() : 정수형으로 변환
# float() : 실수형으로 변환
# str() : 문자형으로 변환

num = int(float('2.5')) # 2.5를 실수형으로 변환한 후 정수형으로 변환
print(num) 

# 산술 연산자
# 기호                  의미                           설명
# + : 덧셈              더하기                          두 수를 더함
# - : 뺄셈              빼기                           두 수를 뺌
# * : 곱셈              곱하기                          두 수를 곱함
# / : 나눗셈            나누기                          두 수를 나눔
# // : 몫              나누기 후 소수점 이하를 버림         나누기 후 몫
# % : 나머지            나누기 후 나머지                  나누기 후 나머지
# ** : 제곱             제곱                          첫 번째 수를 두 번째 수만큼 제곱